In [1]:
import pandas as pd
import json
#for plotting
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

#statistics
import statistics as stat

In [15]:
with open("movies.json",'r') as json_file:
    jmovies=json.load(json_file)
with open("reviews.json",'r') as json_file:
    jreviews=json.load(json_file)

In [19]:
#Make dataframes
movies=pd.DataFrame(jmovies)
reviews0=pd.DataFrame(jreviews)

In [ ]:
reviews

In [ ]:
for taco in reviews["item_id"]:
    print(taco)

In [ ]:
reviews

In [ ]:
#reviews=reviews.drop(["timestamp"],axis=1)
reviews.head()

In [ ]:
#k=range(1,1683)
#create list for adding
l=[]
for taco in range(1682):
    l.append(0)
print(len(l))

In [ ]:
for taco in range(len(reviews["item_id"])):
    if reviews["item_id"][taco]==None:
        l[reviews["item_id"][taco]-1]+=0
    else:
        l[reviews["item_id"][taco]-1]+=1
m=[[0,0],[0,0],[0,0]]
x=0
for taco in range(len(l)):
    x+=1
    
print(x)

In [ ]:
#wrangle and get the top 3 most ranked movies, most reviewed

In [20]:
#pivot table
reviews1=reviews0.pivot(index="user_id",columns='item_id', values="rating")#make pivot
#reviews.reset_index(inplace=True)
reviews=reviews1.dropna(axis=1, how='all')
reviews.head()

item_id,1,2,3,4,5,6,7,8,9,10,...,1673,1674,1675,1676,1677,1678,1679,1680,1681,1682
user_id,,,,,,,,,,,,,,,,,,,,,
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,5.0,3.0,4.0,3.0,3.0,5.0,4.0,1.0,5.0,3.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,4.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [31]:
mostReviewed=3
#other one:topN=reviews.groupby('item_id', axis=1).size().sort_values(ascending=False)
topN=reviews.T.groupby('item_id').size().sort_values(ascending=False).reset_index()[:mostReviewed]

In [32]:
topN

   item_id  0
0        1  1
1     1105  1
2     1129  1

In [6]:
print(reviews)

item_id  1     2     3     4     5     6     7     8     9     10    ...  \
user_id                                                              ...
0         NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  ...
1         5.0   3.0   4.0   3.0   3.0   5.0   4.0   1.0   5.0   3.0  ...
2         4.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   2.0  ...
3         NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  ...
4         NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  ...
...       ...   ...   ...   ...   ...   ...   ...   ...   ...   ...  ...
939       NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   5.0   NaN  ...
940       NaN   NaN   NaN   2.0   NaN   NaN   4.0   5.0   3.0   NaN  ...
941       5.0   NaN   NaN   NaN   NaN   NaN   4.0   NaN   NaN   NaN  ...
942       NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  ...
943       NaN   5.0   NaN   NaN   NaN   NaN   NaN   NaN   3.0   NaN  ...

item_id  1673  1674  1675  1676  1677  1678  1679  1680  1681  1682
user_id
0         NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1         NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2         NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
3         NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
4         NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
...       ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
939       NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
940       NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
941       NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
942       NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
943       NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN

[942 rows x 1682 columns]

In [ ]:
topN

In [ ]:
x=0
for movies in reviews:
    if x=50:

In [ ]:
#actual clustering
from sklearn.cluster import AgglomerativeClustering

In [ ]:
for taco in movies:
    print(movies[taco][title])

In [ ]:
#Trash
x=0
for taco in jmovies:
    if x<=50:
        print(taco)
        x+=1
    else:
        x=51

In [ ]:
#stuff
counts=[]
for movie in movies["item_id"]:
    tally=0
    for i in range(len(reviews)):
        if reviews.iloc[i]['item_id']==movie:
            tally=tally+1
    counts.append(tally)
    print("Movie "+str(movie)+" is done!")

In [ ]:
k=list(reviews["item_id"].unique())
for taco in range(len(k)):
    k[taco]=int(k[taco])
k=k.sort()
print(k)